
/**
 * 연속 부분수열 2
 * N개의 수로 이루어진 수열이 주어집니다.
 * 이 수열에서 연속부분수열의 합이 특정숫자 M이하가 되는 경우가 몇 번 있는지 구하는 프로그 램을 작성하세요.
 * 만약 N=5, M=5이고 수열이 다음과 같다면
 * 13123
 * 합이 5이하가 되는 연속부분수열은
 * {1}, {3}, {1}, {2}, {3}, {1, 3}, {3, 1}, {1, 2}, {2, 3}, {1, 3, 1}로 총 10가지입니다.
 *
 * 입력예제
 * 55 13123
 *
 * 출력예제
 * 10
*/


function solution(m, arr){
  // 1. 왼쪽과 오른쪽의 포인터를 이용한다.
  let answer=0, sum=0, lt=0;
  
  // 2. 결국에 총 부분수열의 합은 (rt - lt + 1) 이라는 규칙을 잘 생각해본다.
  for (let rt =0; rt < arr.length; rt++) {
    sum += arr[rt];
    while (sum > m)  {
      sum-=arr[lt++]
    }
    answer+=(rt-lt+1)
  }
  return answer;
}

let a=[1, 3, 1, 2, 3];
console.log(solution(5, a));
